{
  "pageTitle": "About Me",
  "pageSubtitle": "20+ years building secure, scalable systems in fintech, payments, cybersecurity, and regulated SaaS.",
  "bio": "## Engineering Leader & Builder\n\nI'm Bilal Ahmed—a technical founder and engineering executive with over two decades of experience building mission-critical systems in payments, cybersecurity, and regulated SaaS.\n\nMost recently, I served as **Senior Engineering Manager at Pagos** (US-based fintech), where I led distributed engineering teams and owned core payment infrastructure including network tokenization, account updater, and high-volume data pipelines—processing millions of transactions monthly for merchants like Adobe, Eventbrite, GoFundMe, Groupon, Wix, LastPass, and Crocs.\n\nNow I'm **Co-Founder & CEO at Synvra**, where we're building a compliance-by-design LIMS and validation automation platform for regulated labs (21 CFR Part 11, ALCOA+, ISO 17025).\n\n## What I Do\n\n- **Payment Systems:** Network tokenization (Visa VTS, Mastercard MDES, Discover, Amex DDX), account updater services, high-volume payment data ingestion\n- **Security & Compliance:** AI-powered SOAR platforms, endpoint security, ransomware defense, PCI DSS, SOC 2, secure SDLC\n- **Regulated SaaS:** Compliance-by-design architecture for laboratories and healthcare\n- **Engineering Leadership:** Scaling distributed teams, delivery cadence, release management, on-call operations\n\n## Career Highlights\n\n- **Improved CNP approval rates by 5-7.5%** via PCI-compliant network tokenization across Visa, Mastercard, Discover, and Amex\n- **Reduced recurring payment declines by ~33%** through unified Account Updater service\n- **Built AI-powered SOAR platform** at Barbican LLC for enterprise threat detection and incident response\n- **Designed EIMS for UNDP/GEF** supporting Pakistan's Ministry of Climate Change\n\n## Philosophy\n\nI believe the best systems are built with constraints in mind—security, compliance, and scale shouldn't be afterthoughts. They should be architectural decisions made on day one.",
  "currentRoleTitle": "Current Role",
  "currentRoleDescription": "Co-Founder & CEO at Synvra (Part-time, Advisory)",
  "experienceSummary": "20+ years in engineering, multiple leadership roles",
  "expertiseAreas": "Payments, Security, Compliance, Regulated SaaS"
}
