{
  "title": "Network Tokenization Platform",
  "slug": "payment-orchestration",
  "description": "Led development of PCI-DSS compliant network tokenization solution for Visa, Mastercard, Discover, and Amex, improving CNP approval rates by 5-7.5%.",
  "fullDescription": "A comprehensive network tokenization platform enabling merchants to convert PANs into network tokens across Visa VTS, Mastercard MDES & SCOF, Discover Tokenization, and Amex DDX. The system handles token lifecycle management, fallback scenarios, issuer edge-cases, and performance optimization.",
  "problem": "Card-not-present (CNP) merchants were experiencing suboptimal approval rates due to issuer trust issues with raw PANs and lack of network-level token support.",
  "constraints": "Required PCI-DSS Level 1 compliance, direct integration with all four major card networks, and sub-100ms response times for real-time authorization flows.",
  "approach": "Built a unified tokenization layer supporting Visa VTS, Mastercard MDES & SCOF, Discover Tokenization, and Amex DDX. Implemented lifecycle management, cryptogram generation, and intelligent fallback logic.",
  "tradeoffs": "Chose synchronous token provisioning for reliability over async patterns. Accepted higher integration complexity to support all four networks uniformly.",
  "execution": "Rolled out in phases by card network. Led distributed engineering teams with daily standups, sprint planning, and weekly release trains using Terraform and GitHub Actions CI/CD.",
  "outcomes": "Improved CNP approval rates by 5-7.5% across different card networks. Enabled secure cross-border digital payments for high-volume merchants including Adobe, Eventbrite, GoFundMe, Groupon, Wix, LastPass, and Crocs.",
  "role": "Senior Engineering Manager",
  "category": "Payments",
  "stack": [".NET Framework", "AWS RDS", "AWS SQS", "AWS ECS", "Datadog", "RESTful APIs"],
  "timeline": "2021 - 2025",
  "impact": "5-7.5% approval rate improvement",
  "whatIdImprove": "Would invest in more sophisticated fallback analytics to identify issuer-specific patterns earlier.",
  "featuredImage": "",
  "githubLink": "",
  "demoLink": "",
  "order": 1
}
